Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Provide and configure the alias of the certificate and the private key you want to use:
ja_jp: 使用する証明書と秘密鍵のエイリアスを指定して設定します。

source: Provide authentication for external connections
ja_jp: 外部接続に認証を提供する

source: Provide concise subsequent steps
ja_jp: 簡潔な後続の手順の提供

source: Provide feedback on https://github.com/quarkusio/quarkus/issues[GitHub].
ja_jp: https://github.com/quarkusio/quarkus/issues[GitHub] でフィードバック

source: Provide https://quay.io/quarkus-super-heroes[container images^] for Java versions 11 and 17, both JVM and native.
ja_jp: Javaバージョン11と17（JVMとネイティブの両方）の link:https://quay.io/quarkus-super-heroes[コンテナイメージ, window=_blank]を提供すること。

source: Provide link:#startable[an implementation] of `io.quarkus.deployment.builditem.Startable` which has methods for starting and stopping the new service. For container-based services, extending `GenericContainer` and implementing `Startable` is a good pattern.
ja_jp: 新しいサービスの開始と停止のメソッドを持つ `io.quarkus.deployment.builditem.Startable` の link:#startable[実装] を提供します。コンテナーベースのサービスの場合、 `GenericContainer` を継承して `Startable` を実装するのが良いパターンです。

source: Provide the runtime value returned by your recorder.
ja_jp: レコーダーによって返される実行時の値を指定します。

source: Provide users with initial code for extensions when generating Quarkus applications on code.quarkus.io and all the Quarkus tooling.
ja_jp: code.quarkus.ioや、すべてのQuarkusツールでQuarkusアプリケーションを生成する際に、エクステンション用の初期コードをユーザーに提供する。

source: Provide users with initial code for extensions when generating Quarkus applications on code.quarkus.io and all the Quarkus tooling. This guide explains how to create and configure a Codestart for an extension.
ja_jp: code.quarkus.ioおよびすべてのQuarkusツールでQuarkusアプリケーションを生成する際に、エクステンションの初期コードをユーザーに提供します。このガイドでは、エクステンション用のCodestartを作成して設定する方法を説明します。

source: Provide your contact email address that Let's Encrypt can use to contact you in case of any issues with your Let's Encrypt account.
ja_jp: Let's Encrypt アカウントに問題が発生した場合に Let's Encrypt が連絡するために使用できるメールアドレスを入力します。

source: Provided by JBeret project
ja_jp: 提供：JBeret プロジェクト

source: Provided by the JBeret Project Team
ja_jp: JBeret プロジェクトチーム提供

source: Provided keystores
ja_jp: 提供されたキーストア

source: Provided tag values MUST BE of LOW-CARDINALITY. High-cardinality values can lead to performance and storage issues in your metrics backend (a "cardinality explosion"). Tag values should not use end-user data, since those could be high-cardinality.
ja_jp: 提供されるタグ値は、低いカーディナリティーである必要があります。 カーディナリティー値が高いと、メトリクスのバックエンドでパフォーマンスとストレージの問題が発生する可能性があります (「カーディナリティーの爆発」)。 タグ値にはエンドユーザーデータは使用しないでください。これらは、カーディナリティーが高い可能性があるためです。

source: Provided truststores
ja_jp: 提供されたトラストストア

source: Provider
ja_jp: プロバイダー

source: Provider Endpoint configuration
ja_jp: プロバイダーエンドポイント設定

source: Provider endpoint configuration
ja_jp: プロバイダーエンドポイント設定

source: Provider properties
ja_jp: プロバイダープロパティー

source: Provider registration via Build Items
ja_jp: ビルドアイテムによるプロバイダー登録

source: Provider scopes
ja_jp: プロバイダーのスコープ

source: Providers currently covered are:
ja_jp: 現在、カバーされているプロバイダーは以下の通りです:

source: Provides a helper method to add users with properly hashed passwords. The `BcryptUtil.bcryptHash()` method:
ja_jp: 適切にハッシュ化されたパスワードでユーザーを追加するためのヘルパーメソッドを提供します。 `BcryptUtil.bcryptHash()` メソッドは以下を行います。

source: Provides a site name for your Infinispan cluster
ja_jp: Infinispanクラスタのサイト名を提供します。

source: Provides information about the current endpoint and application URI
ja_jp: 現在のエンドポイントとアプリケーション URI に関する情報を提供します

source: Provides performance metrics from the last build and reload cycle.
ja_jp: 最後のビルドおよびリロードサイクルからのパフォーマンスメトリクスを提供します。

source: Providing Application Level OpenAPI Annotations
ja_jp: アプリケーションレベルのOpenAPIアノテーションの提供

source: Providing Redis Hosts Programmatically
ja_jp: プログラムによる Redis ホストの提供

source: Providing a certificate and key file
ja_jp: 証明書とキーファイルの提供

source: Providing a keystore
ja_jp: キーストアの提供

source: Providing all certificates at build time complicates the CI, specifically in dynamic environments such as Kubernetes where valid certificates are provided by the platform in the `/var/run/secrets/kubernetes.io/serviceaccount/ca.crt` PEM file.
ja_jp: ビルド時にすべての証明書を提供すると、CIが複雑になります。特に、Kubernetesのような動的な環境では、有効な証明書がプラットフォームから `/var/run/secrets/kubernetes.io/serviceaccount/ca.crt` PEMファイルで提供されます。

source: Providing configuration to the running server
ja_jp: 実行中のサーバーへの設定の提供

source: Providing credentials via a Credentials Provider
ja_jp: クレデンシャルプロバイダーを介したクレデンシャルの提供

source: Providing own QuarkusMain
ja_jp: 独自の QuarkusMain の提供

source: Providing your own QuarkusMain
ja_jp: 独自の QuarkusMain の提供

source: Proxies are commonly used to:
ja_jp: プロキシーは一般的に次の目的で使用されます。

source: Proxy authentication can be configured directly using the `username` and `password` properties.
ja_jp: プロキシー認証は、`username` および `password` プロパティーを使用して直接設定できます。

source: Proxy configuration
ja_jp: プロキシー設定

source: Proxy configuration is centralized in a Proxy Registry; configure proxies under the `quarkus.proxy` configuration root.
ja_jp: プロキシー設定はプロキシーレジストリーで一元管理されます。プロキシーは `quarkus.proxy` 設定ルートの下で設定します。

source: Proxy configuration name
ja_jp: プロキシー設定名

source: Proxy support
ja_jp: プロキシーサポート

source: Pseudo option used by Quarkus
ja_jp: Quarkus が使用する擬似オプション

source: Public Keys may be formatted in any of the following formats, specified in order of precedence:
ja_jp: 公開鍵には、優先順位に従って指定された次のいずれかの形式が適用さされます。

source: Public keys can be formatted in any of the following formats, specified in order of precedence:
ja_jp: 公開鍵は、優先順位に従って、次のいずれかの形式でフォーマットできます。

source: Public verification key
ja_jp: 公開検証鍵

source: Publication Date: {{ item.date }}
ja_jp: 公開日: {{ item.date }}

source: Publications
ja_jp: 出版物

source: Publish the documentation you produce for your extension to the Quarkiverse website;
ja_jp: エクステンションのために作成したドキュメントを Quarkiverse の Web サイトに公開します。

source: Publish your extension in registry.quarkus.io
ja_jp: エクステンションを registry.quarkus.io で公開

source: Publishing new records
ja_jp: 新レコードの公開

source: Publishing the application
ja_jp: アプリケーションの公開

source: Publishing your application
ja_jp: アプリケーションの発行

source: Publishing your command line application to a repository makes it a lot easier to consume. Various application repositories are available depending on your requirements such as https://sdkman.io/[SDKMAN!], https://brew.sh/[Homebrew] for macOS, or https://chocolatey.org/[Chocolatey] for Windows.
ja_jp: コマンドラインアプリケーションをリポジトリーに公開すると、使用がはるかに簡単になります。 要件に応じて、https://sdkman.io/[SDKMAN!]、macOS の場合は https://brew.sh/[Homebrew]、Windows の場合は https://chocolatey.org/[Chocolatey] など、さまざまなアプリケーションリポジトリーを利用できます。

source: Pull Requests
ja_jp: プルリクエスト

source: Pull requests that contain changes to documentation will have the `area/documentation` label added automatically.
ja_jp: ドキュメントの変更を含むプルリクエストには、 `area/documentation` のラベルが自動的に追加されます。

source: Pulsar *subscriptionType* consumer configuration can be used flexibly to achieve different messaging scenarios, such as publish-subscribe or queuing.
ja_jp: Pulsar の *subscriptionType* コンシューマー設定は、パブリッシュ - サブスクライブやキューイングなど、さまざまなメッセージングシナリオを実現するために柔軟に使用できます。

source: Pulsar API provides built-in schema information for a number of https://pulsar.apache.org/docs/3.0.x/schema-understand#primitive-type[primitive types] and https://pulsar.apache.org/docs/3.0.x/schema-understand#complex-type[complex types] such as Key/Value, Avro and Protobuf.
ja_jp: Pulsar API は、多数の https://pulsar.apache.org/docs/3.0.x/schema-understand#primitive-type[プリミティブ型] および https://pulsar.apache.org/docs/3.0.x/schema-understand#complex-type[complex 型] (Key/Value、Avro、Protobuf など) に関する組み込みのスキーマ情報を提供します。

source: Pulsar Client Configuration
ja_jp: Pulsar クライアントの設定

source: Pulsar Connector allows receiving properties for those configuration objects directly. For example, the broker authentication information for `PulsarClient` is received using `authPluginClassName` and `authParams` properties. In order to configure the authentication for the incoming channel `data` :
ja_jp: Pulsar コネクターを使用すると、これらの設定オブジェクトのプロパティーを直接受信できます。 たとえば、 `PulsarClient` のブローカー認証情報は、 `authPluginClassName` および `authParams` プロパティーを使用して受信されます。 受信チャネル `data` の認証を設定するには、以下のように指定します。

source: Pulsar Messaging extension integrates with the xref:./tls-registry-reference.adoc[Quarkus TLS registry] to authenticate clients using mTLS.
ja_jp: Pulsar Messagingエクステンションは xref:./tls-registry-reference.adoc[Quarkus TLSレジストリ] と統合し、mTLSを使ってクライアントを認証します。

source: Pulsar Schema Configuration & Auto Schema Discovery
ja_jp: Pulsar Schema 設定と自動スキーマ検出

source: Pulsar Subscription Types
ja_jp: Pulsar のサブスクリプションタイプ

source: Pulsar Transactions API also allows managing consumer offsets inside a transaction, together with produced messages. This in turn enables coupling a consumer with a transactional producer in a consume-transform-produce pattern, also known as exactly-once processing. It means that an application consumes messages, processes them, publishes the results to a topic, and commits offsets of the consumed messages in a transaction.
ja_jp: Pulsar Transactions API を使用すると、生成されたメッセージとともに、トランザクション内のコンシューマーオフセットを管理することもできます。 これにより、コンシューマーとトランザクションプロデューサーを consume-transform-produce パターンでカップリングすることができます。これは exactly-once 処理としても知られています。 これは、アプリケーションがメッセージを消費および処理し、結果をトピックに公開して、消費されたメッセージのオフセットをトランザクションでコミットすることを意味します。

source: Pulsar Transactions and Exactly-Once Processing
ja_jp: Pulsar トランザクションと exactly-once 処理

source: Pulsar client Attributes
ja_jp: Pulsar クライアント属性

source: Pulsar clients, consumers and producers are very customizable to configure how a Pulsar client application behaves.
ja_jp: Pulsar のクライアント、コンシューマー、プロデューサーは、Pulsar クライアントアプリケーションの動作を設定するために、細かくカスタマイズすることが可能です。

source: Pulsar cluster HTTP URL to connect to a broker.
ja_jp: ブローカーに接続するためのPulsarクラスタHTTP URL。

source: Pulsar connector provides `PulsarTransactions` custom emitter for writing records inside a transaction.
ja_jp: Pulsar コネクターは、トランザクション内にレコードを書き込むための `PulsarTransactions` カスタムエミッターを提供します。

source: Pulsar consumer Attributes
ja_jp: Pulsar コンシューマー属性

source: Pulsar implements the publish-subscribe pattern:
ja_jp: Pulsar はパブリッシュ - サブスクライブパターンを実装します。

source: Pulsar messages are stored with payloads as unstructured byte array. A Pulsar **schema** defines how to serialize structured data to the raw message bytes. The **schema** is applied in producers and consumers to write and read with an enforced data structure. It serializes data into raw bytes before they are published to a topic and deserializes the raw bytes before they are delivered to consumers.
ja_jp: Pulsar メッセージは、ペイロードとともに非構造化バイト配列として保存されます。 Pulsar **スキーマ** は、構造化データを raw メッセージバイトにシリアライズする方法を定義します。 **スキーマ** は、強制的なデータ構造での書き込みと読み取りを行うために、プロデューサーとコンシューマーに適用されます。 スキーマは、データがトピックに公開される前にデータを raw バイトにシリアライズします。また、raw バイトがコンシューマーに配信される前に raw バイトをデシリアライズします。

source: Pulsar producer Attributes
ja_jp: Pulsar プロデューサー属性

source: Pulsar provides a pluggable authentication framework, and Pulsar brokers/proxies use this mechanism to authenticate clients.
ja_jp: Pulsar は、プラグ可能な認証フレームワークを提供します。Pulsar ブローカー/プロキシーは、このメカニズムを使用してクライアントを認証します。

source: Pulsar uses a schema registry as a central repository to store the registered schema information, which enables producers/consumers to coordinate the schema of a topic's messages through brokers. By default the Apache BookKeeper is used to store schemas.
ja_jp: Pulsar は、登録されたスキーマ情報を保存する中央リポジトリーとしてスキーマレジストリーを使用します。 これにより、プロデューサー/コンシューマーがブローカーを通じてトピックのメッセージのスキーマを調整できるようになります。 デフォルトでは、スキーマの保存に Apache BookKeeper が使用されます。

source: Pulsar: Only mTLS authentication is supported.
ja_jp: Pulsar: mTLS 認証のみがサポートされます。

source: Push Notifications
ja_jp: プッシュ通知

source: Push and release the image
ja_jp: イメージをプッシュしてリリースする

source: Push your image to docker hub or quay
ja_jp: イメージをDocker HubやQuayにプッシュする

source: Pushed Authorization Requests
ja_jp: プッシュ認可リクエスト

source: Pushing
ja_jp: プッシュ

source: Pushing as much as possible into the `@Record(STATIC_INIT)` phase allows for two different optimizations:
ja_jp: `@Record(STATIC_INIT)` フェーズにできるだけ多くのものを押し込むことで、2つの異なる最適化が可能になります。

source: Pushing through Docker
ja_jp: Dockerによるプッシュ

source: Pushing through Podman
ja_jp: Podmanを通じたプッシュ

source: Put the greeting id as a key and the Greeting pojo as a value
ja_jp: 挨拶の idをキーに、Greeting POJO をバリューとして格納します。

source: Put the link:{quickstarts-tree-url}/security-openid-connect-quickstart/config/quarkus-realm.json[realm configuration file] in the `src/main/resources` application folder so that it gets copied to the classpath and imported automatically to Keycloak. You do not need to do this if you have already built a link:{quickstarts-tree-url}/security-openid-connect-quickstart[complete solution], in which case, this realm file is added to the classpath during the build.
ja_jp: link:{quickstarts-tree-url}/security-openid-connect-quickstart/config/quarkus-realm.json[レルム設定ファイル] を `src/main/resources` アプリケーションフォルダーに配置して、クラスパスにコピーされ、Keycloak に自動的にインポートされるようにします。link:{quickstarts-tree-url}/security-openid-connect-quickstart[完全なソリューション] をすでにビルドしている場合は、これを実行する必要はありません。その場合は、このレルムファイルがビルド中にクラスパスに追加されます。

source: Put the link:{quickstarts-tree-url}/security-openid-connect-quickstart/config/quarkus-realm.json[realm configuration file] on the classpath (`target/classes` directory) so that it gets imported automatically when running in dev mode. You do not need to do this if you have already built a link:{quickstarts-tree-url}/security-openid-connect-quickstart[complete solution], in which case, this realm file is added to the classpath during the build.
ja_jp: link:{quickstarts-tree-url}/security-openid-connect-quickstart/config/quarkus-realm.json[レルム設定ファイル] をクラスパス (`target/classes` ディレクトリー) に配置し、開発モードで実行する際に自動的にインポートされるようにします。 すでに link:{quickstarts-tree-url}/security-openid-connect-quickstart[完全なソリューション] をビルド済みの場合は、このレルムファイルはビルド時にクラスパスに追加されるため、この手順は必要ありません。

source: Putting it all together, the `Fruit.findAll` method looks like:
ja_jp: すべてをまとめると、 `Fruit.findAll` メソッドは次のようになります。

source: Putting things together - bridging HTTP and messages
ja_jp: 登場した要素の組み立て - HTTP とメッセージの橋渡し

source: QUARKUS GUIDES
ja_jp: Quarkus ガイド

source: Qualified Injected Fields
ja_jp: 修飾された注入フィールド

source: Qualified host name
ja_jp: 修飾ホスト名

source: Qualifier Example
ja_jp: 修飾子の例

source: Qualifiers
ja_jp: 修飾子

source: Qualifies the injection point so that we know which named client needs to be injected here.
ja_jp: インジェクションポイントを修飾することで、どの名前のクライアントをここに注入する必要があるかを知ることができます。

source: Quarkiverse Hub - Home of Community Extensions
ja_jp: Quarkiverse Hub - コミュニティエクステンションの本拠地

source: Quarkiverse is a separate GitHub organization (https://github.com/quarkiverse) that offers:
ja_jp: Quarkiverse は GitHub とは別の組織 (https://github.com/quarkiverse) で、以下を提供します。

source: Quarkus & Kubernetes I Cheat Sheet
ja_jp: Quarkus & Kubernetes I チートシート

source: Quarkus & Kubernetes II Cheat Sheet
ja_jp: Quarkus & Kubernetes II チートシート

source: Quarkus & Observability Cheat Sheet
ja_jp: Quarkus & Observability チートシート

source: Quarkus 1.10 has been released. JSON is now the default content type for your REST resources, multiple reactive datasources are supported and we added several registries to our Micrometer extension.
ja_jp: Quarkus 1.10がリリースされました。JSONがRESTリソースのデフォルトのコンテンツタイプになり、複数のリアクティブデータソースがサポートされ、Micrometerエクステンションにいくつかのレジストリーが追加されました。

source: Quarkus 1.10 released - JSON as default, Multiple reactive datasources, new Micrometer registries...
ja_jp: Quarkus 1.10リリース - デフォルトのJSON、複数のリアクティブデータソース、新しいMicrometerレジストリ...

source: Quarkus 1.10.3.Final released - Bugfixes
ja_jp: Quarkus 1.10.3.Final リリース - バグフィックス

source: Quarkus 1.10.5.Final released - Bugfixes
ja_jp: Quarkus 1.10.5.Final リリース - バグフィックス

source: Quarkus 1.11 has been released. It comes with RESTEasy Reactive, a Dev UI, Micrometer enhancements, dev mode support for jbang, and Spring Data REST.
ja_jp: Quarkus 1.11がリリースされました。RESTEasy Reactive、Dev UI、Micrometerの強化、jbangのdev modeサポート、Spring Data RESTが搭載されています。

source: Quarkus 1.11 introduces the infrastructure of this Dev UI and some features already. If you are an extension developer or wants to do some frontend work, additions and improvements are very welcome.
ja_jp: Quarkus 1.11では、このDev UIのインフラと、すでにいくつかの機能が提供されています。もしあなたがエクステンションの開発者であったり、フロントエンドの仕事をしたいと思っているなら、追加や改善は大歓迎です。

source: Quarkus 1.11 released - RESTEasy Reactive, Dev UI, and more!
ja_jp: Quarkus 1.11リリース - RESTEasy Reactive、Dev UI等々!

source: Quarkus 1.11.1.Final released - Bugfixes
ja_jp: Quarkus 1.11.1.Final リリース - バグフィックス

source: Quarkus 1.11.2.Final released - Bugfixes
ja_jp: Quarkus 1.11.2.Final リリース - バグフィックス

source: Quarkus 1.11.3.Final released - Bugfixes
ja_jp: Quarkus 1.11.3.Final リリース - バグフィックス

source: Quarkus 1.12 released - Fast jar as default, Multipart support for RESTEasy Reactive
ja_jp: Quarkus 1.12リリース - Fast jarのデフォルト化、RESTEasy ReactiveでMultipartをサポート

source: Quarkus 1.12.1.Final released - Bugfixes
ja_jp: Quarkus 1.12.1.Final リリース - バグフィックス

source: Quarkus 1.12.2.Final released - Bugfixes
ja_jp: Quarkus 1.12.2.Final リリース - バグフィックス

source: Quarkus 1.13 brings new features simplifying even further your development and deployment.
ja_jp: Quarkus 1.13では、新機能が追加され、開発および導入がさらに簡単になりました。

source: Quarkus 1.13 comes with `quarkus-jacoco` which will automatically generate your test coverage reports. And it does not require any Maven setup anymore. More about this in link:/guides/tests-with-coverage[our updated guide].
ja_jp: Quarkus 1.13には、テストカバレッジレポートを自動的に生成する `quarkus-jacoco` が存在します。また、Mavenのセットアップも必要ありません。詳しくは、 link:/guides/tests-with-coverage[改訂されたガイド]をご覧ください。

source: Quarkus 1.13 introduces a new extension for OpenTelemetry called `quarkus-opentelemetry` which offers the ability to trace requests. For exporting traces to a Jaeger collector, use the `quarkus-opentelemetry-exporter-jaeger` extension which depends on `quarkus-opentelemetry`. With this initial version, traces are available in JAX-RS Resource methods, REST Client, and Reactive Messaging with Kafka. Further integrations with other extensions will come in future releases, as well as a guide and quickstart.
ja_jp: Quarkus 1.13では、OpenTelemetryの新しいエクステンション（ `quarkus-opentelemetry` ）が導入され、リクエストをトレースする機能が提供されています。トレースをJaegerコレクターにエクスポートするには、 `quarkus-opentelemetry` に依存する `quarkus-openeltemetry-exporter-jaeger` を使用してください。この初期バージョンでは、JAX-RS Resourceメソッド、REST Client、およびReactive Messaging with Kafkaでトレースが利用できます。他のエクステンションとの統合は、ガイドやクイックスタートと同様に、今後のリリースで行われる予定です。

source: Quarkus 1.13 introduces a pure-Vert.x-based Websockets extension called `quarkus-websockets`.
ja_jp: Quarkus 1.13では、 `quarkus-websockets` という純粋なVert.xベースのWebsocketsエクステンションが導入されています。

source: Quarkus 1.13 released - DevServices, Kubernetes Service Binding, OpenTelemetry
ja_jp: Quarkus 1.13リリース - DevServices、Kubernetesサービスバインディング、OpenTelemetry

source: Quarkus 1.13.1.Final released - Bugfixes
ja_jp: Quarkus 1.13.1.Final リリース - バグフィックス

source: Quarkus 1.13.2.Final released - Oracle JDBC driver extension, bugfixes
ja_jp: Quarkus 1.13.2.Final リリース - Oracle JDBCドライバのエクステンション、バグ修正

source: Quarkus 1.13.3.Final released - Maintenance release
ja_jp: Quarkus 1.13.3.Finalリリース - メンテナンスリリース

source: Quarkus 1.13.4.Final released - Maintenance release
ja_jp: Quarkus 1.13.4.Finalリリース - メンテナンスリリース

source: Quarkus 1.13.5.Final released - Maintenance release
ja_jp: Quarkus 1.13.5.Finalリリース - メンテナンスリリース

source: Quarkus 1.13.6.Final released - Maintenance release
ja_jp: Quarkus 1.13.6.Finalリリース - メンテナンスリリース

source: Quarkus 1.13.7.Final released - Maintenance release
ja_jp: Quarkus 1.13.7.Finalリリース - メンテナンスリリース

source: Quarkus 1.8 introduces a new extension for Micrometer called `quarkus-micrometer`. Please refer to link:/guides/micrometer[its guide] to learn more about it.
ja_jp: Quarkus 1.8では、 `quarkus-micrometer` と呼ばれるMicrometerのための新しいエクステンションが導入されました。詳細については、 link:/guides/micrometer[このガイド] を参照してください。

source: Quarkus 1.8 provides integration with https://jbang.dev[jbang]] which allows you to write Java scripts/applications requiring no Maven nor Gradle to get running.
ja_jp: Quarkus 1.8は link:https://jbang.dev[jbang] との統合を提供します。これにより、MavenやGradleを実行する必要のないJavaのスクリプトやアプリケーションを書けます。

source: Quarkus 1.9 comes with a lot of improvements on top of our existing feature set:
ja_jp: Quarkus 1.9 では、既存の機能セットに対して多くの改良が加えられています。

source: Quarkus 1.9.1.Final released - Bugfixes
ja_jp: Quarkus 1.9.1.Final リリース - バグフィックス

source: Quarkus 1.9.2.Final released - Bugfixes
ja_jp: Quarkus 1.9.2.Final リリース - バグフィックス

source: Quarkus 2 introduced the Dev UI, which provides a web UI to use during development. Extensions could provide their own Dev UI pages to provide additional functionality.
ja_jp: Quarkus 2では、開発中に使用するWeb UIを提供するDev UIが導入されました。エクステンションは、独自のDev UIページを提供して、追加機能を提供することができました。

source: Quarkus 2 was based on Jakarta EE 8. Quarkus 3 is based on Jakarta EE 10.
ja_jp: Quarkus 2は、Jakarta EE 8をベースにしていました。Quarkus 3は、Jakarta EE 10をベースにしています。

source: Quarkus 2.0 brings Vert.x 4. You can learn more about it in https://vertx.io/blog/eclipse-vert-x-4-released/[the announcement] and the https://vertx.io/blog/whats-new-in-vert-x-4/[What's new blog post].
ja_jp: Quarkus 2.0はVert.x 4を搭載しています。詳細は link:https://vertx.io/blog/eclipse-vert-x-4-released/[アナウンス]と link:https://vertx.io/blog/whats-new-in-vert-x-4/[変更点のブログ記事]でご覧いただけます。

source: Quarkus 2.0 continues the mission of making Java the preferred framework for Kubernetes-native development with new developer tools and improved performance.
ja_jp: Quarkus 2.0は、新しい開発者ツールと改善されたパフォーマンスにより、JavaをKubernetesネイティブ開発に適したフレームワークにするという使命を継続します。

source: Quarkus 2.0.0.Alpha1 released - Vert.x 4, MicroProfile 4 and Continuous Testing
ja_jp: Quarkus 2.0.0.Alpha1 リリース - Vert.x 4、MicroProfile 4、継続的テスト

source: Quarkus 2.0.0.Alpha2 released - Continuous Testing improvements
ja_jp: Quarkus 2.0.0.Alpha2リリース - 継続的テストの改善

source: Quarkus 2.0.0.Alpha3 released - GraalVM 21.1, SmallRye GraphQL Client...
ja_jp: Quarkus 2.0.0.Alpha3 リリース - GraalVM 21.1、SmallRye GraphQL Client...

source: Quarkus 2.0.0.CR2 released - Towards Final
ja_jp: Quarkus 2.0.0.CR2リリース - Finalに向けて

source: Quarkus 2.0.0.CR3 released - Towards Final
ja_jp: Quarkus 2.0.0.CR3リリース - 最終版に向けて

source: Quarkus 2.0.0.Final released - Vert.x 4, MicroProfile 4, Continuous Testing and much more
ja_jp: Quarkus 2.0.0.Final リリース - Vert.x 4、MicroProfile 4、継続的テスト、その他多数

source: Quarkus 2.0.1.Final released - Maintenance release
ja_jp: Quarkus 2.0.1.Final リリース - メンテナンスリリース

source: Quarkus 2.0.2.Final released - Maintenance release
ja_jp: Quarkus 2.0.2.Finalリリース - メンテナンスリリース

source: Quarkus 2.0.3.Final released - Maintenance release
ja_jp: Quarkus 2.0.3.Finalリリース - メンテナンスリリース

source: Quarkus 2.1.0.Final released - Dev Service for Keycloak, Reactive SQL Server extension, Kotlin 1.5
ja_jp: Quarkus 2.1.0.Final リリース - Keycloak用Dev Service、Reactive SQL Serverエクステンション、Kotlin 1.5

source: Quarkus 2.1.1.Final released - Maintenance release
ja_jp: Quarkus 2.1.1.Finalリリース - メンテナンスリリース

source: Quarkus 2.1.2.Final released - Maintenance release
ja_jp: Quarkus 2.1.2.Finalリリース - メンテナンスリリース

source: Quarkus 2.1.3.Final released - Maintenance release
ja_jp: Quarkus 2.1.3.Finalリリース - メンテナンスリリース

source: Quarkus 2.1.4.Final released - Maintenance release
ja_jp: Quarkus 2.1.4.Finalリリース - メンテナンスリリース

source: Quarkus 2.10.0.Final released - Preliminary work on Loom's virtual threads and various refinements all over the place
ja_jp: Quarkus 2.10.0.Final リリース - Loomの仮想スレッドの準備作業と様々な改良をあちこちに施しました。

source: Quarkus 2.10.3.Final released - Fixes CVE-2022-2466
ja_jp: Quarkus 2.10.3.Final リリース - CVE-2022-2466を修正

source: Quarkus 2.11 introduces a modernized Redis Client API.
ja_jp: Quarkus 2.11では、モダナイズされたRedisクライアントAPIが導入されています。
